
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = Константы.МС_Адрес.Получить();
	Порт = Константы.МС_Порт.Получить();
	ПутьHTTPСервиса = Константы.МС_ПутьHTTPСервиса.Получить();
	Пользователь = Константы.МС_Пользователь.Получить();
	Пароль = Константы.МС_Пароль.Получить();
	ТаймаутHTTP = Константы.МС_ТаймаутHTTP.Получить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНастройкиНаСервере();
	НовоеСообщение = Новый СообщениеПользователю;
	НовоеСообщение.Текст = "Настройки обмена сохранены.";
	НовоеСообщение.Сообщить();
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	Константы.МС_Адрес.Установить(Адрес);
	Константы.МС_Порт.Установить(Порт);
	Константы.МС_ПутьHTTPСервиса.Установить(ПутьHTTPСервиса);
	Константы.МС_Пользователь.Установить(Пользователь);
	Константы.МС_Пароль.Установить(Пароль);
	Константы.МС_ТаймаутHTTP.Установить(ТаймаутHTTP);
КонецПроцедуры

#КонецОбласти

