
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрыПодключения = МС_МодульОбменаВызовСервера.ПараметрыПодключения();
	Если ПараметрыПодключения <> Неопределено Тогда
		Объект.АдресСервера = ПараметрыПодключения.АдресСервера;
		Объект.APIkey = ПараметрыПодключения.APIkey;
		Объект.ИДБазы = ПараметрыПодключения.ИДБазы;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаписатьНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыПодключения = Новый Структура("АдресСервера, APIkey, ИДБазы", 
		Объект.АдресСервера, Объект.APIkey, Объект.ИДБазы);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		"ПараметрыПодключенияМагистральСтаркам", ПараметрыПодключения);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
