
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Актуализировать(Команда)
	АктуализироватьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьВДругуюБазу(Команда)
	ОтправитьВДругуюБазуНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОтправитьВДругуюБазуНаСервере()
	МС_МодульОбменаВызовСервера.ВыгрузитьВсюНоменклатуру();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АктуализироватьНаСервере()
	
	Набор = РегистрыСведений.МС_НаименованиеНоменклатуры.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Набор.Загрузить(РезультатЗапроса );
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти